note-elasticsearch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-13 Tue 11:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>elasticsearch 相关知识整理</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">elasticsearch 相关知识整理</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5f0c6f7">note-elasticsearch-install&amp;config</a>
<ul>
<li><a href="#orgf96e979">install</a></li>
<li><a href="#orgb8ece94">cat command</a></li>
<li><a href="#org2b58e73">Mapping</a></li>
<li><a href="#org559b276">CURD</a></li>
<li><a href="#orgf78a587">Query</a></li>
<li><a href="#org3c36e38">Alias</a></li>
<li><a href="#org3fc7153">questions</a>
<ul>
<li><a href="#org2d94d2d">from szie/scroll/search after</a></li>
<li><a href="#org9acb04b">es shard 生命周期</a></li>
<li><a href="#orgb38d260">分词</a></li>
<li><a href="#org39ce43e">es node</a></li>
<li><a href="#orga9697e0">es pipeline</a></li>
<li><a href="#org00a1dfe">es</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5f0c6f7" class="outline-2">
<h2 id="org5f0c6f7">note-elasticsearch-install&amp;config</h2>
<div class="outline-text-2" id="text-org5f0c6f7">
</div>
<div id="outline-container-orgf96e979" class="outline-3">
<h3 id="orgf96e979">install</h3>
<div class="outline-text-3" id="text-orgf96e979">
<p>
安装环境: VMware12: 三台 ubuntu 14.04 内存 1g
</p>
<ol class="org-ol">
<li>download es
<a href="https://www.elastic.co/downloads/elasticsearch">https://www.elastic.co/downloads/elasticsearch</a></li>
<li>install java 8</li>
<li>vim elasticsearch.yml
访问地址修改:
network.host : 192.168.67.128
http.port:9200</li>
<li>sudo vi /etc/sysctl.conf
 kernel.pid_max=999999
 kernel.thread-max=999999
 vm.max_map_count=999999
 fs.file-max=999999
sysctl -a|grep vm.max_map_count</li>
<li>ulimit -Hn 
/etc/security/limits.conf 配置修改为 65536  重启服务器</li>
</ol>
</div>
</div>

<div id="outline-container-orgb8ece94" class="outline-3">
<h3 id="orgb8ece94">cat command</h3>
<div class="outline-text-3" id="text-orgb8ece94">
<p>
vim  /etc/security/limits.conf
vim   /etc/security/limits.d/def.conf
</p>

<p>
sudo netstat -anp |grep 9200
htop
show python
curl localhost:9200/_cat/shards/?v |grep -v STARTED |less
curl -XGET 'localhost:9200/_cat/recovery/webasset_scan?v'
</p>

<p>
ES 常用操作命令总结：
1.索引状态
curl localhost:9200/_cat/indices?v
2.文件描述符
curl localhost:9200/_nodes/stats/process?pretty | less
3.集群健康
curl localhost:9200/_cluster/health?pretty | less
curl 'localhost:9200/_cluster/health?level=indices&amp;pretty' | less
curl localhost:9200/_cat/health?v| less
</p>

<p>
curl 'localhost:9200/_cat/allocation?v'
4.分片状态
curl localhost:9200/_cat/shards/formal_webasset_scan?v
5.当前任务
curl localhost:9200/_tasks?pretty | less
6.查看别名
curl localhost:9200/webasset*/_alias?pretty |less
7.查看 relocate 进度
curl -XGET 'localhost:9200/_cat/recovery/ipasset_seer4?v'
8.优化（慎用，会消耗全部可用资源，尤其是磁盘 io）
curl -XPOST 'localhost:9200/threat_ip2/_optimize?max_num_segments=3&amp;pretty'
9.查看 segment
curl localhost:9200/_cat/segments/ipasset_seer4?v
</p>

<p>
新建索引
curl -XPUT 'localhost:9200/index_name/?pretty' -d '{"settings":{"number_of_replicas":0}}'
curl -XPOST localhost:9200/index_name/_mapping/type_name?pretty -d @mapping_file
动态改副本数量
curl -XPUT 'localhost:9200/index_name/_settings?pretty' -d '{"number_of_replicas":1}'
设置别名
curl -XPUT 'localhost:9200/index_name/_alias/alias_name?pretty'
修改别名
curl -XPOST 'localhost:9200/_aliases?pretty' -d '{"actions":[{"remove":{"index":"webasset_subdomain_v2","alias":"formal_webasset_subdomain"}},{"add":{"index":"webasset_subdomain_v1","alias":"formal_webasset_subdomain"}}]}'
</p>

<ol class="org-ol">
<li>允许自动分配分片(alloctattion disable  关掉) 重启 es 前需要关掉
curl -XPUT '10.24.45.94:9200/_settings' -d '{
  "index.routing.allocation.disable_allocation": false
}'</li>
<li>curl -XPUT 10.24.45.94:9200/_cluster/settings -d '
{
    "transient" : {
        "cluster.routing.allocation.enable": true
    }
}'</li>
<li>最大恢复</li>
</ol>
<p>
curl -XPUT localhost:9200/_cluster/settings -d '{
     "transient" : {
         "indices.recovery.max_bytes_per_sec" : 80000000
     }
 }'
</p>
<ol class="org-ol">
<li>拉取数据后挂掉 先删除任务 (shard 重路由之前可以先尝试)
curl -XDELETE 10.24.45.94:9200/_search/scroll/_all</li>
<li>reroute
curl -XPOST '10.24.45.94:9200/_cluster/reroute' -d @reroute.mapping</li>
<li></li>
</ol>
</div>
</div>
<div id="outline-container-org2b58e73" class="outline-3">
<h3 id="org2b58e73">Mapping</h3>
<div class="outline-text-3" id="text-org2b58e73">
<ol class="org-ol">
<li>建立索引
curl -XPUT 'localhost:9200/threat_ip_history/?pretty' -d{"settings":{"number_of_shards":20}}
curl -XPUT '10.200.1.72:9200/ipasset_seer_lower/_settings'  -d {"number_of_replicas":1}</li>
<li><p>
设置 mapping 
curl -XPOST 'localhost:9200/threat_ip_history/_mapping/ipv4?pretty' -d @mapping_file 
</p>

<p>
mapping 存放到文件内
</p>
<div class="org-src-container">
<pre class="src src-python">
{
<span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"ipv4"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"dynamic_templates"</span>: [
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"notanalyzed"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"mapping"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"index"</span>: <span style="color: #E6DB74;">"not_analyzed"</span>,
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"type"</span>: <span style="color: #E6DB74;">"string"</span>
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> },
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"match"</span>: <span style="color: #E6DB74;">"*"</span>,
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"match_mapping_type"</span>: <span style="color: #E6DB74;">"string"</span>
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> }
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> }
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> ],
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"properties"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"activity"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"include_in_parent"</span>: true,
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"properties"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"threat_type"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"index"</span>: <span style="color: #E6DB74;">"not_analyzed"</span>,
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"type"</span>: <span style="color: #E6DB74;">"string"</span>
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> },
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"update_time"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"format"</span>: <span style="color: #E6DB74;">"YYYY-MM-dd'T'HH:mm:ss"</span>,
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"type"</span>: <span style="color: #E6DB74;">"date"</span>
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> }
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> },
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"type"</span>: <span style="color: #E6DB74;">"nested"</span>
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> },
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"ip"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"fields"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"raw"</span>: {
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"type"</span>: <span style="color: #E6DB74;">"ip"</span>
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> }
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> },
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> <span style="color: #E6DB74;">"type"</span>: <span style="color: #E6DB74;">"string"</span>
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> }
<span style="background-color: #232526;"> </span>   <span style="background-color: #232526;"> </span> }
<span style="background-color: #232526;"> </span> }
}
</pre>
</div></li>
<li>删除索引
curl -XDELETE localhost:9200/index_name</li>
</ol>
</div>
</div>

<div id="outline-container-org559b276" class="outline-3">
<h3 id="org559b276">CURD</h3>
<div class="outline-text-3" id="text-org559b276">
<ol class="org-ol">
<li>添加一条记录
curl -XPUT 'http://localhost:9200/twitter/tweet/1' -d  '{_source 内容}'</li>
<li>删除一条记录
curl -XDELETE 'http://localhost:9200/twitter/tweet/1'</li>
</ol>
</div>
</div>
<div id="outline-container-orgf78a587" class="outline-3">
<h3 id="orgf78a587">Query</h3>
<div class="outline-text-3" id="text-orgf78a587">
<ol class="org-ol">
<li><p>
基本查询
</p>

<p>
curl -XGET 'http://localhost:9200/ipasset_seer4/asset_from_seer/_search?pretty&amp;q=ip:210.186.226.178'
</p>

<p>
curl -XGET  'localhost:9200/webasset_whois3/whois_info/_search?pretty&amp;q=_id:PERSONALLICENCECOURSES.COM'
</p></li>
<li><p>
DSL 查询
1.query bool must/filter match/term
</p>
<pre class="example">

{
  "query": { 
    "bool": { 
      "must": [
        { "match": { "title":   "Search"        }}, 
        { "match": { "content": "Elasticsearch" }}  
      ],
      "filter": [ 
        { "term":  { "status": "published" }}, 
        { "range": { "publish_date": { "gte": "2015-01-01" }}} 
      ]
    }
  }
}

</pre>
<p>
2.query/sort
</p>
<pre class="example">
{
       "query": {
           "bool": {
               "must": [
                   {
                       "term": {
                           "ip.raw": "210.186.226.178"
                       }
                   }
               ],
               "must_not": [ ],
               "should": [ ]
           }
       },
       "sort": {
         "started": "desc"
       },
   }
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org3c36e38" class="outline-3">
<h3 id="org3c36e38">Alias</h3>
<div class="outline-text-3" id="text-org3c36e38">
<ol class="org-ol">
<li>创建 alias
curl -XPOST 'localhost:9200/_aliases' -d '{"actions":[{"add":{"index" : "vulnerability_data_v4","alias" : "formal_vulnerability_data"}}]}'</li>
<li>删除 alias
curl -XPOST 'localhost:9200/_aliases' -d '{"actions":[{"remove":{"index" : "vulnerability_data_v4","alias" : "formal_vulnerability_data"}}]}'</li>
<li><p>
创建映射多个索引:
</p>
<pre class="example">
curl -XPOST 'http://localhost:9200/_aliases'-d '  
{  
    "actions" : [  
        { "add" : { "index" : "test1","alias" : "alias1" } },  
        { "add" : { "index" : "test2","alias" : "alias1" } }  
    ]  
}'  
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org3fc7153" class="outline-3">
<h3 id="org3fc7153">questions</h3>
<div class="outline-text-3" id="text-org3fc7153">
</div>
<div id="outline-container-org2d94d2d" class="outline-4">
<h4 id="org2d94d2d">from szie/scroll/search after</h4>
<div class="outline-text-4" id="text-org2d94d2d">
<p>
<a href="http://www.jianshu.com/p/91d03b16af77">http://www.jianshu.com/p/91d03b16af77</a>
</p>

<p>
在使用关系型数据库中，我们被告知要注意甚至被明确禁止使用深度分页，同理，在 Elasticsearch 中，也应该尽量避免使用深度分页
</p>

<p>
深度分页的问题:CUP、内存、IO、网络带宽问题  10个shard*一亿条数据的doc_id
</p>

<ul class="org-ul">
<li><p>
from size
</p>

<p>
100+10、110+10&#x2026;..10000+10 越往后请求的越多
</p></li>

<li><p>
scroll:
</p>

<p>
query fetch merge
</p>

<p>
查询结果缓存,每次fetch size*shard文档 merge输出
</p>

<p>
scroll不适合做实时查询: 1.初始化结果缓存成快照 2.fetch数据，操作数据
</p>

<p>
search_type。赋值为scan，表示采用 Scroll-Scan 的方式遍历，同时告诉 Elasticsearch 搜索结果不需要排序
</p>

<p>
size 控制的是每个分片的返回的数据量而不是整个请求返回的数据量。
</p></li>

<li><p>
search after
</p>

<p>
1.必须先要指定排序,记住坐标
</p>

<p>
2.从任意一个位置 带上search_after=lastEmittedDocFieldValue 偏移量查数据
</p>

<p>
如果我要做非常多页的查询时，最起码search after是一个常量查询延迟和开销，并无什么副作用。
</p>

<p>
无论去到多少页，请求始终就是请求了size个docs,是个常量 
</p>

<p>
业务折衷一：禁止跳页查询 只提供下一页
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org9acb04b" class="outline-4">
<h4 id="org9acb04b">es shard 生命周期</h4>
<div class="outline-text-4" id="text-org9acb04b">
<p>
<a href="http://lxwei.github.io/posts/Elasticsearch-Shard-%E7%94%9F%E5%91%BD%E5%91%A8%E6%9C%9F.html">http://lxwei.github.io/posts/Elasticsearch-Shard-生命周期.html</a>
</p>
<ul class="org-ul">
<li><p>
动态索引 
三个关键的索引结构：倒排列表、临时索引、已删除列表 
</p>

<ul class="org-ul">
<li>临时索引
临时索引是在内存中实时建立的倒排索引，结果与倒排列表一样，
只是存在于内存中，当有新文档时，实时解析文档并加到这个临时索引中</li>
<li>已删除列表
已删除列表存储已被删除的文档的文档ID
一个文档被修改，搜索引擎一般删除旧文档，新建新文档,间接实现更新,
这么做的原因主要是索引文件存储在磁盘文件，写磁盘不方便</li>
<li>倒排列表
倒排索引是已经建好的索引结果，倒排列表存在磁盘文件中，单词词典在内存中</li>
</ul>

<p>
搜索操作：同时到内存和磁盘中查找，合并，然后利用已删除列表过滤文档
</p></li>
<li><p>
es动态更新
segment是lucence定义的索引段，一个索引内包含多个，segment对外提供搜索服务
</p>

<p>
新文档&#x2013;&gt;内存的buffer内&#x2013;&gt;写到磁盘生成新的segment，对外服务 同时清空buffer
</p>

<p>
要频繁的写入磁盘十分消耗资源,es先将文档写到filesystem cache内，此时就能被搜索到了(linux下文件句柄要调整)
</p>

<p>
必须调用fsync将segment刷到磁盘上，才能保证数据不丢失。
</p></li>

<li><p>
refresh/flush
</p>

<p>
refresh是轻量级的写和打开一个新segment的操作
</p>

<p>
Elasticsearch中，执行commit操作并删除translog的操作叫flush
</p></li>

<li><p>
segment merge
</p>

<p>
如果不停的产生新的segment，Elasticsearch中很快就会段爆炸，
每个段都要消耗文件描述符、内存、CPU 周期，且每个search请求都需要遍历所有的segment，会造成搜索操作很慢。
</p>

<p>
_optimize?max_num_segments=1 一个segment情况下查询要快些，但是得控制大小，
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgb38d260" class="outline-4">
<h4 id="orgb38d260">分词</h4>
</div>
<div id="outline-container-org39ce43e" class="outline-4">
<h4 id="org39ce43e">es node</h4>
<div class="outline-text-4" id="text-org39ce43e">
<ul class="org-ul">
<li>data node 上
http.enabled: false，同时也不要安装head, bigdesk, marvel等监控 插件
http功能可以在非数据节点服务器上开启
一台服务器上最好只部署一个Node</li>
<li>避免脑裂现象
<ol class="org-ol">
<li><p>
discovery.zen.minimum_master_nodes N/2+1
</p>

<p>
要选举一个Master需要多少了候选节点，默认为1
3节点的集群 3/2+1 = 2(向下取整)
</p></li>
<li><p>
discovery.zen.ping.timeout
</p>

<p>
等待ping响应的超时时间，默认值是3秒。如果网络缓慢或拥塞，建议略微调大这个值
</p></li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orga9697e0" class="outline-4">
<h4 id="orga9697e0">es pipeline</h4>
<div class="outline-text-4" id="text-orga9697e0">
<p>
<a href="https://www.felayman.com/articles/2017/11/24/1511527532643.html#b3_solo_h4_22">https://www.felayman.com/articles/2017/11/24/1511527532643.html#b3_solo_h4_22</a>
</p>
</div>
</div>
<div id="outline-container-org00a1dfe" class="outline-4">
<h4 id="org00a1dfe">es</h4>
<div class="outline-text-4" id="text-org00a1dfe">
<p>
<a href="https://blog.csdn.net/donghaixiaolongwang/article/category/6747676">https://blog.csdn.net/donghaixiaolongwang/article/category/6747676</a>
</p>

<p>
Elasticsearch之四种查询类型和搜索原理</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>